mrdunk/home_automation_2/esp8266/TestServer/http_server.cpp
    if(esp8266_http_server.hasArg("iotype")){
      if (esp8266_http_server.arg("iotype") == "pwm") {
        device.io_type = Io_Type::pwm;
      } else if (esp8266_http_server.arg("iotype") == "onoff") {
        device.io_type = Io_Type::onoff;
      } else if (esp8266_http_server.arg("iotype") == "input") {
        device.io_type = Io_Type::input;
      } else if (esp8266_http_server.arg("iotype") == "inputPullUp") {
        device.io_type = Io_Type::input_pullup;
      } else if (esp8266_http_server.arg("iotype") == "timer") {
        device.io_type = Io_Type::timer;
      } else {
        device.io_type = Io_Type::test;
      }
    }

    if(esp8266_http_server.hasArg("io_pin")){
      device.io_pin = esp8266_http_server.arg("io_pin").toInt();
    }
    if(esp8266_http_server.hasArg("io_default")){
      device.io_default = esp8266_http_server.arg("io_default").toInt();
    }
    if(esp8266_http_server.hasArg("inverted")){
      if(esp8266_http_server.arg("inverted") == "true"){
        device.inverted = true;
      } else if(esp8266_http_server.arg("inverted") == "false"){
        device.inverted = false;
      } else {
        device.inverted = esp8266_http_server.arg("inverted").toInt();
      }
    }

    SetDevice(index, device);

    sucess &= bufferInsert("device: " + esp8266_http_server.arg("device") + "\n");

    // Force reconnect to MQTT so we subscribe to any new addresses.
    mqtt->forceDisconnect();
    io->setup();
  }
  
  Persist_Data::Persistent<Config> persist_config(config);
  persist_config.writeConfig();

  Serial.println(buffer);

  Serial.println("onSet() -");
  esp8266_http_server.send((sucess ? 200 : 500), "text/plain", buffer);
}

// Set the config->pull_firmware bit in flash and reboot so we pull new firmware on
// next boot.
void HttpServer::onPullFirmware(){
  String message = "Pulling firmware\n";
  esp8266_http_server.send(200, "text/plain", message);
  
  config->pull_firmware = true;
  Persist_Data::Persistent<Config> persist_config(config);
  persist_config.writeConfig();
  
  delay(100);
  ESP.reset();
}

void HttpServer::onReset() {
  Serial.println("restarting host");
  delay(100);
  ESP.reset();

  esp8266_http_server.send(200, "text/plain", "restarting host");
}

void HttpServer::bufferClear(){
  buffer[0] = '\0';
}

bool HttpServer::bufferAppend(const String& to_add){
  return bufferAppend(to_add.c_str());
}

bool HttpServer::bufferAppend(const char* to_add){
  strncat(buffer, to_add, buffer_size - strlen(buffer) -1);
  return ((buffer_size - strlen(buffer) -1) >= strlen(to_add));
}

bool HttpServer::bufferInsert(const String& to_insert){
  return bufferInsert(to_insert.c_str());
}

bool HttpServer::bufferInsert(const char* to_insert){
  if((buffer_size - strlen(buffer) -1) >= strlen(to_insert)){
    *(buffer + strlen(to_insert) + strlen(buffer)) = '\0';
    memmove(buffer + strlen(to_insert), buffer, strlen(buffer));
    memcpy(buffer, to_insert, strlen(to_insert));
    return true;
  }
  return false;
}

